earlephilhower/arduino-pico/boards.txt
arduino_nano_connect.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
arduino_nano_connect.menu.uploadmethod.default.upload.maximum_data_size=262144
arduino_nano_connect.menu.uploadmethod.default.upload.tool=uf2conv
arduino_nano_connect.menu.uploadmethod.default.upload.tool.default=uf2conv
arduino_nano_connect.menu.uploadmethod.default.upload.tool.network=uf2conv-network
arduino_nano_connect.menu.uploadmethod.picotool=Picotool
arduino_nano_connect.menu.uploadmethod.picotool.build.ram_length=256k
arduino_nano_connect.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
arduino_nano_connect.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
arduino_nano_connect.menu.uploadmethod.picotool.upload.maximum_data_size=262144
arduino_nano_connect.menu.uploadmethod.picotool.upload.tool=picotool
arduino_nano_connect.menu.uploadmethod.picotool.upload.tool.default=picotool
arduino_nano_connect.menu.uploadmethod.picoprobe=Picoprobe
arduino_nano_connect.menu.uploadmethod.picoprobe.build.ram_length=256k
arduino_nano_connect.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
arduino_nano_connect.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
arduino_nano_connect.menu.uploadmethod.picoprobe.upload.tool=picoprobe
arduino_nano_connect.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
arduino_nano_connect.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
arduino_nano_connect.menu.uploadmethod.picodebug=Pico-Debug
arduino_nano_connect.menu.uploadmethod.picodebug.build.ram_length=240k
arduino_nano_connect.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
arduino_nano_connect.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
arduino_nano_connect.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
arduino_nano_connect.menu.uploadmethod.picodebug.upload.tool=picodebug
arduino_nano_connect.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# ArtronShop RP2 Nano
# -----------------------------------
artronshop_rp2_nano.name=ArtronShop RP2 Nano
artronshop_rp2_nano.vid.0=0x2e8a
artronshop_rp2_nano.pid.0=0x000a
artronshop_rp2_nano.vid.1=0x2e8a
artronshop_rp2_nano.pid.1=0x010a
artronshop_rp2_nano.vid.2=0x2e8a
artronshop_rp2_nano.pid.2=0x400a
artronshop_rp2_nano.vid.3=0x2e8a
artronshop_rp2_nano.pid.3=0x410a
artronshop_rp2_nano.vid.4=0x2e8a
artronshop_rp2_nano.pid.4=0x800a
artronshop_rp2_nano.vid.5=0x2e8a
artronshop_rp2_nano.pid.5=0x810a
artronshop_rp2_nano.vid.6=0x2e8a
artronshop_rp2_nano.pid.6=0xc00a
artronshop_rp2_nano.vid.7=0x2e8a
artronshop_rp2_nano.pid.7=0xc10a
artronshop_rp2_nano.build.usbvid=-DUSBD_VID=0x2e8a
artronshop_rp2_nano.build.usbpid=-DUSBD_PID=0x000a
artronshop_rp2_nano.build.usbpwr=-DUSBD_MAX_POWER_MA=250
artronshop_rp2_nano.build.board=ARTRONSHOP_RP2_NANO
artronshop_rp2_nano.build.mcu=cortex-m0plus
artronshop_rp2_nano.build.variant=artronshop_rp2_nano
artronshop_rp2_nano.upload.maximum_size=2097152
artronshop_rp2_nano.upload.wait_for_upload_port=true
artronshop_rp2_nano.upload.erase_cmd=
artronshop_rp2_nano.serial.disableDTR=false
artronshop_rp2_nano.serial.disableRTS=false
artronshop_rp2_nano.build.f_cpu=125000000
artronshop_rp2_nano.build.led=
artronshop_rp2_nano.build.core=rp2040
artronshop_rp2_nano.build.ldscript=memmap_default.ld
artronshop_rp2_nano.build.boot2=boot2_w25q080_2_padded_checksum
artronshop_rp2_nano.build.usb_manufacturer="ArtronShop"
artronshop_rp2_nano.build.usb_product="RP2 Nano"
artronshop_rp2_nano.menu.flash.2097152_0=2MB (no FS)
artronshop_rp2_nano.menu.flash.2097152_0.upload.maximum_size=2093056
artronshop_rp2_nano.menu.flash.2097152_0.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_0.build.flash_length=2093056
artronshop_rp2_nano.menu.flash.2097152_0.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_0.build.fs_start=270528512
artronshop_rp2_nano.menu.flash.2097152_0.build.fs_end=270528512
artronshop_rp2_nano.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
artronshop_rp2_nano.menu.flash.2097152_65536.upload.maximum_size=2027520
artronshop_rp2_nano.menu.flash.2097152_65536.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_65536.build.flash_length=2027520
artronshop_rp2_nano.menu.flash.2097152_65536.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_65536.build.fs_start=270462976
artronshop_rp2_nano.menu.flash.2097152_65536.build.fs_end=270528512
artronshop_rp2_nano.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
artronshop_rp2_nano.menu.flash.2097152_131072.upload.maximum_size=1961984
artronshop_rp2_nano.menu.flash.2097152_131072.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_131072.build.flash_length=1961984
artronshop_rp2_nano.menu.flash.2097152_131072.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_131072.build.fs_start=270397440
artronshop_rp2_nano.menu.flash.2097152_131072.build.fs_end=270528512
artronshop_rp2_nano.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
artronshop_rp2_nano.menu.flash.2097152_262144.upload.maximum_size=1830912
artronshop_rp2_nano.menu.flash.2097152_262144.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_262144.build.flash_length=1830912
artronshop_rp2_nano.menu.flash.2097152_262144.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_262144.build.fs_start=270266368
artronshop_rp2_nano.menu.flash.2097152_262144.build.fs_end=270528512
artronshop_rp2_nano.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
artronshop_rp2_nano.menu.flash.2097152_524288.upload.maximum_size=1568768
artronshop_rp2_nano.menu.flash.2097152_524288.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_524288.build.flash_length=1568768
artronshop_rp2_nano.menu.flash.2097152_524288.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_524288.build.fs_start=270004224
artronshop_rp2_nano.menu.flash.2097152_524288.build.fs_end=270528512
artronshop_rp2_nano.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
artronshop_rp2_nano.menu.flash.2097152_1048576.upload.maximum_size=1044480
artronshop_rp2_nano.menu.flash.2097152_1048576.build.flash_total=2097152
artronshop_rp2_nano.menu.flash.2097152_1048576.build.flash_length=1044480
artronshop_rp2_nano.menu.flash.2097152_1048576.build.eeprom_start=270528512
artronshop_rp2_nano.menu.flash.2097152_1048576.build.fs_start=269479936
artronshop_rp2_nano.menu.flash.2097152_1048576.build.fs_end=270528512
artronshop_rp2_nano.menu.freq.133=133 MHz
artronshop_rp2_nano.menu.freq.133.build.f_cpu=133000000L
artronshop_rp2_nano.menu.freq.50=50 MHz
artronshop_rp2_nano.menu.freq.50.build.f_cpu=50000000L
artronshop_rp2_nano.menu.freq.100=100 MHz
artronshop_rp2_nano.menu.freq.100.build.f_cpu=100000000L
artronshop_rp2_nano.menu.freq.120=120 MHz
artronshop_rp2_nano.menu.freq.120.build.f_cpu=120000000L
artronshop_rp2_nano.menu.freq.125=125 MHz
artronshop_rp2_nano.menu.freq.125.build.f_cpu=125000000L
artronshop_rp2_nano.menu.freq.150=150 MHz (Overclock)
artronshop_rp2_nano.menu.freq.150.build.f_cpu=150000000L
artronshop_rp2_nano.menu.freq.175=175 MHz (Overclock)
artronshop_rp2_nano.menu.freq.175.build.f_cpu=175000000L
artronshop_rp2_nano.menu.freq.200=200 MHz (Overclock)
artronshop_rp2_nano.menu.freq.200.build.f_cpu=200000000L
artronshop_rp2_nano.menu.freq.225=225 MHz (Overclock)
artronshop_rp2_nano.menu.freq.225.build.f_cpu=225000000L
artronshop_rp2_nano.menu.freq.240=240 MHz (Overclock)
artronshop_rp2_nano.menu.freq.240.build.f_cpu=240000000L
artronshop_rp2_nano.menu.freq.250=250 MHz (Overclock)
artronshop_rp2_nano.menu.freq.250.build.f_cpu=250000000L
artronshop_rp2_nano.menu.freq.275=275 MHz (Overclock)
artronshop_rp2_nano.menu.freq.275.build.f_cpu=275000000L
artronshop_rp2_nano.menu.freq.300=300 MHz (Overclock)
artronshop_rp2_nano.menu.freq.300.build.f_cpu=300000000L
artronshop_rp2_nano.menu.opt.Small=Small (-Os) (standard)
artronshop_rp2_nano.menu.opt.Small.build.flags.optimize=-Os
artronshop_rp2_nano.menu.opt.Optimize=Optimize (-O)
artronshop_rp2_nano.menu.opt.Optimize.build.flags.optimize=-O
artronshop_rp2_nano.menu.opt.Optimize2=Optimize More (-O2)
artronshop_rp2_nano.menu.opt.Optimize2.build.flags.optimize=-O2
artronshop_rp2_nano.menu.opt.Optimize3=Optimize Even More (-O3)
artronshop_rp2_nano.menu.opt.Optimize3.build.flags.optimize=-O3
artronshop_rp2_nano.menu.opt.Fast=Fast (-Ofast) (maybe slower)
artronshop_rp2_nano.menu.opt.Fast.build.flags.optimize=-Ofast
artronshop_rp2_nano.menu.opt.Debug=Debug (-Og)
artronshop_rp2_nano.menu.opt.Debug.build.flags.optimize=-Og
artronshop_rp2_nano.menu.rtti.Disabled=Disabled
artronshop_rp2_nano.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
artronshop_rp2_nano.menu.rtti.Enabled=Enabled
artronshop_rp2_nano.menu.rtti.Enabled.build.flags.rtti=
artronshop_rp2_nano.menu.stackprotect.Disabled=Disabled
artronshop_rp2_nano.menu.stackprotect.Disabled.build.flags.stackprotect=
artronshop_rp2_nano.menu.stackprotect.Enabled=Enabled
artronshop_rp2_nano.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
artronshop_rp2_nano.menu.exceptions.Disabled=Disabled
artronshop_rp2_nano.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
artronshop_rp2_nano.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
artronshop_rp2_nano.menu.exceptions.Enabled=Enabled
artronshop_rp2_nano.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
artronshop_rp2_nano.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
artronshop_rp2_nano.menu.dbgport.Disabled=Disabled
artronshop_rp2_nano.menu.dbgport.Disabled.build.debug_port=
artronshop_rp2_nano.menu.dbgport.Serial=Serial
artronshop_rp2_nano.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
artronshop_rp2_nano.menu.dbgport.Serial1=Serial1
artronshop_rp2_nano.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
artronshop_rp2_nano.menu.dbgport.Serial2=Serial2
artronshop_rp2_nano.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
artronshop_rp2_nano.menu.dbglvl.None=None
artronshop_rp2_nano.menu.dbglvl.None.build.debug_level=
artronshop_rp2_nano.menu.dbglvl.Core=Core
artronshop_rp2_nano.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
artronshop_rp2_nano.menu.dbglvl.SPI=SPI
artronshop_rp2_nano.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
artronshop_rp2_nano.menu.dbglvl.Wire=Wire
artronshop_rp2_nano.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
artronshop_rp2_nano.menu.dbglvl.All=All
artronshop_rp2_nano.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
artronshop_rp2_nano.menu.dbglvl.NDEBUG=NDEBUG
artronshop_rp2_nano.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
artronshop_rp2_nano.menu.usbstack.picosdk=Pico SDK
artronshop_rp2_nano.menu.usbstack.picosdk.build.usbstack_flags=
artronshop_rp2_nano.menu.usbstack.tinyusb=Adafruit TinyUSB
artronshop_rp2_nano.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
artronshop_rp2_nano.menu.usbstack.nousb=No USB
artronshop_rp2_nano.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
artronshop_rp2_nano.menu.ipbtstack.ipv4only=IPv4 Only
artronshop_rp2_nano.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
artronshop_rp2_nano.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
artronshop_rp2_nano.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
artronshop_rp2_nano.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
artronshop_rp2_nano.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
artronshop_rp2_nano.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
artronshop_rp2_nano.menu.uploadmethod.default=Default (UF2)
artronshop_rp2_nano.menu.uploadmethod.default.build.ram_length=256k
artronshop_rp2_nano.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
artronshop_rp2_nano.menu.uploadmethod.default.upload.maximum_data_size=262144
artronshop_rp2_nano.menu.uploadmethod.default.upload.tool=uf2conv
artronshop_rp2_nano.menu.uploadmethod.default.upload.tool.default=uf2conv
artronshop_rp2_nano.menu.uploadmethod.default.upload.tool.network=uf2conv-network
artronshop_rp2_nano.menu.uploadmethod.picotool=Picotool
artronshop_rp2_nano.menu.uploadmethod.picotool.build.ram_length=256k
artronshop_rp2_nano.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
artronshop_rp2_nano.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
artronshop_rp2_nano.menu.uploadmethod.picotool.upload.maximum_data_size=262144
artronshop_rp2_nano.menu.uploadmethod.picotool.upload.tool=picotool
artronshop_rp2_nano.menu.uploadmethod.picotool.upload.tool.default=picotool
artronshop_rp2_nano.menu.uploadmethod.picoprobe=Picoprobe
artronshop_rp2_nano.menu.uploadmethod.picoprobe.build.ram_length=256k
artronshop_rp2_nano.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
artronshop_rp2_nano.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
artronshop_rp2_nano.menu.uploadmethod.picoprobe.upload.tool=picoprobe
artronshop_rp2_nano.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
artronshop_rp2_nano.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
artronshop_rp2_nano.menu.uploadmethod.picodebug=Pico-Debug
artronshop_rp2_nano.menu.uploadmethod.picodebug.build.ram_length=240k
artronshop_rp2_nano.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
artronshop_rp2_nano.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
artronshop_rp2_nano.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
artronshop_rp2_nano.menu.uploadmethod.picodebug.upload.tool=picodebug
artronshop_rp2_nano.menu.uploadmethod.picodebug.upload.tool.default=picodebug

