earlephilhower/arduino-pico/boards.txt
melopero_shake_rp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
melopero_shake_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
melopero_shake_rp2040.menu.uploadmethod.default=Default (UF2)
melopero_shake_rp2040.menu.uploadmethod.default.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_shake_rp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool=uf2conv
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
melopero_shake_rp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
melopero_shake_rp2040.menu.uploadmethod.picotool=Picotool
melopero_shake_rp2040.menu.uploadmethod.picotool.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
melopero_shake_rp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.tool=picotool
melopero_shake_rp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
melopero_shake_rp2040.menu.uploadmethod.picoprobe=Picoprobe
melopero_shake_rp2040.menu.uploadmethod.picoprobe.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
melopero_shake_rp2040.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.picoprobe.upload.tool=picoprobe
melopero_shake_rp2040.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
melopero_shake_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
melopero_shake_rp2040.menu.uploadmethod.picodebug=Pico-Debug
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
melopero_shake_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
melopero_shake_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

# -----------------------------------
# Neko Systems BL2040 Mini
# -----------------------------------
nekosystems_bl2040_mini.name=Neko Systems BL2040 Mini
nekosystems_bl2040_mini.vid.0=0x2e8a
nekosystems_bl2040_mini.pid.0=0x000a
nekosystems_bl2040_mini.vid.1=0x2e8a
nekosystems_bl2040_mini.pid.1=0x010a
nekosystems_bl2040_mini.vid.2=0x2e8a
nekosystems_bl2040_mini.pid.2=0x400a
nekosystems_bl2040_mini.vid.3=0x2e8a
nekosystems_bl2040_mini.pid.3=0x410a
nekosystems_bl2040_mini.vid.4=0x2e8a
nekosystems_bl2040_mini.pid.4=0x800a
nekosystems_bl2040_mini.vid.5=0x2e8a
nekosystems_bl2040_mini.pid.5=0x810a
nekosystems_bl2040_mini.vid.6=0x2e8a
nekosystems_bl2040_mini.pid.6=0xc00a
nekosystems_bl2040_mini.vid.7=0x2e8a
nekosystems_bl2040_mini.pid.7=0xc10a
nekosystems_bl2040_mini.build.usbvid=-DUSBD_VID=0x2e8a
nekosystems_bl2040_mini.build.usbpid=-DUSBD_PID=0x000a
nekosystems_bl2040_mini.build.usbpwr=-DUSBD_MAX_POWER_MA=500
nekosystems_bl2040_mini.build.board=NEKOSYSTEMS_BL2040_MINI
nekosystems_bl2040_mini.build.mcu=cortex-m0plus
nekosystems_bl2040_mini.build.variant=nekosystems_bl2040_mini
nekosystems_bl2040_mini.upload.maximum_size=4194304
nekosystems_bl2040_mini.upload.wait_for_upload_port=true
nekosystems_bl2040_mini.upload.erase_cmd=
nekosystems_bl2040_mini.serial.disableDTR=false
nekosystems_bl2040_mini.serial.disableRTS=false
nekosystems_bl2040_mini.build.f_cpu=125000000
nekosystems_bl2040_mini.build.led=
nekosystems_bl2040_mini.build.core=rp2040
nekosystems_bl2040_mini.build.ldscript=memmap_default.ld
nekosystems_bl2040_mini.build.boot2=boot2_generic_03h_2_padded_checksum
nekosystems_bl2040_mini.build.usb_manufacturer="Neko Systems"
nekosystems_bl2040_mini.build.usb_product="BL2040 Mini"
nekosystems_bl2040_mini.menu.flash.4194304_0=4MB (no FS)
nekosystems_bl2040_mini.menu.flash.4194304_0.upload.maximum_size=4190208
nekosystems_bl2040_mini.menu.flash.4194304_0.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_0.build.flash_length=4190208
nekosystems_bl2040_mini.menu.flash.4194304_0.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_0.build.fs_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_0.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
nekosystems_bl2040_mini.menu.flash.4194304_65536.upload.maximum_size=4124672
nekosystems_bl2040_mini.menu.flash.4194304_65536.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_65536.build.flash_length=4124672
nekosystems_bl2040_mini.menu.flash.4194304_65536.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_65536.build.fs_start=272560128
nekosystems_bl2040_mini.menu.flash.4194304_65536.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
nekosystems_bl2040_mini.menu.flash.4194304_131072.upload.maximum_size=4059136
nekosystems_bl2040_mini.menu.flash.4194304_131072.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_131072.build.flash_length=4059136
nekosystems_bl2040_mini.menu.flash.4194304_131072.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_131072.build.fs_start=272494592
nekosystems_bl2040_mini.menu.flash.4194304_131072.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
nekosystems_bl2040_mini.menu.flash.4194304_262144.upload.maximum_size=3928064
nekosystems_bl2040_mini.menu.flash.4194304_262144.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_262144.build.flash_length=3928064
nekosystems_bl2040_mini.menu.flash.4194304_262144.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_262144.build.fs_start=272363520
nekosystems_bl2040_mini.menu.flash.4194304_262144.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
nekosystems_bl2040_mini.menu.flash.4194304_524288.upload.maximum_size=3665920
nekosystems_bl2040_mini.menu.flash.4194304_524288.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_524288.build.flash_length=3665920
nekosystems_bl2040_mini.menu.flash.4194304_524288.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_524288.build.fs_start=272101376
nekosystems_bl2040_mini.menu.flash.4194304_524288.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
nekosystems_bl2040_mini.menu.flash.4194304_1048576.upload.maximum_size=3141632
nekosystems_bl2040_mini.menu.flash.4194304_1048576.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_1048576.build.flash_length=3141632
nekosystems_bl2040_mini.menu.flash.4194304_1048576.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_1048576.build.fs_start=271577088
nekosystems_bl2040_mini.menu.flash.4194304_1048576.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
nekosystems_bl2040_mini.menu.flash.4194304_2097152.upload.maximum_size=2093056
nekosystems_bl2040_mini.menu.flash.4194304_2097152.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_2097152.build.flash_length=2093056
nekosystems_bl2040_mini.menu.flash.4194304_2097152.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_2097152.build.fs_start=270528512
nekosystems_bl2040_mini.menu.flash.4194304_2097152.build.fs_end=272625664
nekosystems_bl2040_mini.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
nekosystems_bl2040_mini.menu.flash.4194304_3145728.upload.maximum_size=1044480
nekosystems_bl2040_mini.menu.flash.4194304_3145728.build.flash_total=4194304
nekosystems_bl2040_mini.menu.flash.4194304_3145728.build.flash_length=1044480
nekosystems_bl2040_mini.menu.flash.4194304_3145728.build.eeprom_start=272625664
nekosystems_bl2040_mini.menu.flash.4194304_3145728.build.fs_start=269479936
nekosystems_bl2040_mini.menu.flash.4194304_3145728.build.fs_end=272625664
nekosystems_bl2040_mini.menu.freq.133=133 MHz
nekosystems_bl2040_mini.menu.freq.133.build.f_cpu=133000000L
nekosystems_bl2040_mini.menu.freq.50=50 MHz
nekosystems_bl2040_mini.menu.freq.50.build.f_cpu=50000000L
nekosystems_bl2040_mini.menu.freq.100=100 MHz
nekosystems_bl2040_mini.menu.freq.100.build.f_cpu=100000000L
nekosystems_bl2040_mini.menu.freq.120=120 MHz
nekosystems_bl2040_mini.menu.freq.120.build.f_cpu=120000000L
nekosystems_bl2040_mini.menu.freq.125=125 MHz
nekosystems_bl2040_mini.menu.freq.125.build.f_cpu=125000000L
nekosystems_bl2040_mini.menu.freq.150=150 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.150.build.f_cpu=150000000L
nekosystems_bl2040_mini.menu.freq.175=175 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.175.build.f_cpu=175000000L
nekosystems_bl2040_mini.menu.freq.200=200 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.200.build.f_cpu=200000000L
nekosystems_bl2040_mini.menu.freq.225=225 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.225.build.f_cpu=225000000L
nekosystems_bl2040_mini.menu.freq.240=240 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.240.build.f_cpu=240000000L
nekosystems_bl2040_mini.menu.freq.250=250 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.250.build.f_cpu=250000000L
nekosystems_bl2040_mini.menu.freq.275=275 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.275.build.f_cpu=275000000L
nekosystems_bl2040_mini.menu.freq.300=300 MHz (Overclock)
nekosystems_bl2040_mini.menu.freq.300.build.f_cpu=300000000L
nekosystems_bl2040_mini.menu.opt.Small=Small (-Os) (standard)
nekosystems_bl2040_mini.menu.opt.Small.build.flags.optimize=-Os
nekosystems_bl2040_mini.menu.opt.Optimize=Optimize (-O)
nekosystems_bl2040_mini.menu.opt.Optimize.build.flags.optimize=-O
nekosystems_bl2040_mini.menu.opt.Optimize2=Optimize More (-O2)
nekosystems_bl2040_mini.menu.opt.Optimize2.build.flags.optimize=-O2
nekosystems_bl2040_mini.menu.opt.Optimize3=Optimize Even More (-O3)
nekosystems_bl2040_mini.menu.opt.Optimize3.build.flags.optimize=-O3
nekosystems_bl2040_mini.menu.opt.Fast=Fast (-Ofast) (maybe slower)
nekosystems_bl2040_mini.menu.opt.Fast.build.flags.optimize=-Ofast
nekosystems_bl2040_mini.menu.opt.Debug=Debug (-Og)
nekosystems_bl2040_mini.menu.opt.Debug.build.flags.optimize=-Og
nekosystems_bl2040_mini.menu.rtti.Disabled=Disabled
nekosystems_bl2040_mini.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
nekosystems_bl2040_mini.menu.rtti.Enabled=Enabled
nekosystems_bl2040_mini.menu.rtti.Enabled.build.flags.rtti=
nekosystems_bl2040_mini.menu.stackprotect.Disabled=Disabled
nekosystems_bl2040_mini.menu.stackprotect.Disabled.build.flags.stackprotect=
nekosystems_bl2040_mini.menu.stackprotect.Enabled=Enabled
nekosystems_bl2040_mini.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
nekosystems_bl2040_mini.menu.exceptions.Disabled=Disabled
nekosystems_bl2040_mini.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
nekosystems_bl2040_mini.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
nekosystems_bl2040_mini.menu.exceptions.Enabled=Enabled
nekosystems_bl2040_mini.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
nekosystems_bl2040_mini.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
nekosystems_bl2040_mini.menu.dbgport.Disabled=Disabled
nekosystems_bl2040_mini.menu.dbgport.Disabled.build.debug_port=
nekosystems_bl2040_mini.menu.dbgport.Serial=Serial
nekosystems_bl2040_mini.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
nekosystems_bl2040_mini.menu.dbgport.Serial1=Serial1
nekosystems_bl2040_mini.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
nekosystems_bl2040_mini.menu.dbgport.Serial2=Serial2
nekosystems_bl2040_mini.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
nekosystems_bl2040_mini.menu.dbglvl.None=None
nekosystems_bl2040_mini.menu.dbglvl.None.build.debug_level=
nekosystems_bl2040_mini.menu.dbglvl.Core=Core
nekosystems_bl2040_mini.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
nekosystems_bl2040_mini.menu.dbglvl.SPI=SPI
nekosystems_bl2040_mini.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
nekosystems_bl2040_mini.menu.dbglvl.Wire=Wire
nekosystems_bl2040_mini.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
nekosystems_bl2040_mini.menu.dbglvl.All=All
nekosystems_bl2040_mini.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
nekosystems_bl2040_mini.menu.dbglvl.NDEBUG=NDEBUG
nekosystems_bl2040_mini.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
nekosystems_bl2040_mini.menu.usbstack.picosdk=Pico SDK
nekosystems_bl2040_mini.menu.usbstack.picosdk.build.usbstack_flags=
nekosystems_bl2040_mini.menu.usbstack.tinyusb=Adafruit TinyUSB
nekosystems_bl2040_mini.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
nekosystems_bl2040_mini.menu.usbstack.nousb=No USB
nekosystems_bl2040_mini.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
nekosystems_bl2040_mini.menu.ipbtstack.ipv4only=IPv4 Only
nekosystems_bl2040_mini.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
nekosystems_bl2040_mini.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
nekosystems_bl2040_mini.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
nekosystems_bl2040_mini.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
nekosystems_bl2040_mini.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
nekosystems_bl2040_mini.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
nekosystems_bl2040_mini.menu.uploadmethod.default=Default (UF2)
nekosystems_bl2040_mini.menu.uploadmethod.default.build.ram_length=256k
nekosystems_bl2040_mini.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
nekosystems_bl2040_mini.menu.uploadmethod.default.upload.maximum_data_size=262144
nekosystems_bl2040_mini.menu.uploadmethod.default.upload.tool=uf2conv
nekosystems_bl2040_mini.menu.uploadmethod.default.upload.tool.default=uf2conv
nekosystems_bl2040_mini.menu.uploadmethod.default.upload.tool.network=uf2conv-network
nekosystems_bl2040_mini.menu.uploadmethod.picotool=Picotool
nekosystems_bl2040_mini.menu.uploadmethod.picotool.build.ram_length=256k
nekosystems_bl2040_mini.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
nekosystems_bl2040_mini.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
nekosystems_bl2040_mini.menu.uploadmethod.picotool.upload.maximum_data_size=262144
nekosystems_bl2040_mini.menu.uploadmethod.picotool.upload.tool=picotool
nekosystems_bl2040_mini.menu.uploadmethod.picotool.upload.tool.default=picotool
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe=Picoprobe
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe.build.ram_length=256k
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe.upload.tool=picoprobe
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
nekosystems_bl2040_mini.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
nekosystems_bl2040_mini.menu.uploadmethod.picodebug=Pico-Debug
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.build.ram_length=240k
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.upload.tool=picodebug
nekosystems_bl2040_mini.menu.uploadmethod.picodebug.upload.tool.default=picodebug

